In [1]:
from datascience import *
import datetime
import matplotlib.pyplot as plt
import numpy as np

%matplotlib inline

In [2]:
Vehicle_Shipment_Requirement = Table.read_table('DataSet1/VehicleShipmentRequirement_DataSet1.csv')
Ship_Details = Table.read_table('DataSet1/Results Template 4_ShipDetails_DataSet1.csv')
VDC = Table.read_table('DataSet1/Results Template 1_VDC_DataSet1.csv')
Routing_Details = Table.read_table('DataSet1/Results Template 3_RoutingDetails_DataSet1.csv')
Ship_Stops = Table.read_table('DataSet1/Results Template 5_ShipStops_DataSet1.csv')
Lead_time = Table.read_table('DataSet1/Results Template 6_Leadtime_DataSet1.csv')

In [4]:
Ship_Stops.group('Shipment ID')

Shipment ID        | count
1/1/2011-2409-MR-1 | 2
1/1/2011-5705-MR-1 | 4
1/1/2011-5705-MR-2 | 4
1/1/2011-6164-MR-1 | 3
1/1/2011-6684-MR-1 | 2
1/1/2011-7643-MR-1 | 6
1/1/2011-7643-MR-2 | 3
1/1/2011-7656-MR-1 | 2
1/1/2011-7665-MR-1 | 2
1/1/2011-7671-MR-1 | 2
... (200796 rows omitted)

In [5]:
Vehicle_Shipment_Requirement.group('Plant')

Plant | count
3A    | 405124
FF    | 277761
RO    | 562211
SO    | 546335

In [9]:
Routing_Details.where('Shipment ID','1/1/2012-5705-MR-12')

VIN     | LOC  | Arrive Time         | Depart Time      | Depart Mode | Shipment ID         | Shipment Cost
1       | BE   | 12/23/2011 22:43:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
22445   | BE   | 12/23/2011 22:27:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
52841   | BE   | 12/27/2011 20:34:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
526177  | BE   | 12/27/2011 21:07:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
878803  | BE   | 12/27/2011 23:52:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
884542  | BE   | 12/27/2011 23:52:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
981070  | BE   | 12/26/2011 17:48:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
1020624 | BE   | 12/25/2011 2:36:00  | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
1285168 | BE   | 12/22/2011 20:11:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan
1608827 | BE   | 12/26/2011 17:48:00 | 1/1/2012 6:00:00 | T           | 1/1/2012-5705-MR-12 | nan

In [10]:
Routing_Details.where('LOC','BE')

VIN  | LOC  | Arrive Time         | Depart Time        | Depart Mode | Shipment ID           | Shipment Cost
1    | BE   | 12/23/2011 22:43:00 | 1/1/2012 6:00:00   | T           | 1/1/2012-5705-MR-12   | nan
34   | BE   | 6/4/2011 10:49:00   | 6/12/2011 6:00:00  | T           | 6/12/2011-5705-MR-8   | nan
47   | BE   | 6/13/2011 9:08:00   | 6/18/2011 6:00:00  | T           | 6/18/2011-5705-MR-13  | nan
58   | BE   | 4/15/2012 0:13:00   | 4/19/2012 6:00:00  | T           | 4/19/2012-5705-MR-16  | nan
63   | BE   | 11/10/2011 17:37:00 | 11/18/2011 6:00:00 | T           | 11/18/2011-5705-MR-14 | nan
69   | BE   | 11/4/2011 22:35:00  | 11/9/2011 6:00:00  | T           | 11/9/2011-5705-MR-4   | nan
71   | BE   | 5/17/2011 0:13:00   | 5/23/2011 6:00:00  | T           | 5/23/2011-5705-MR-1   | nan
88   | BE   | 7/1/2012 0:18:00    | 7/9/2012 6:00:00   | T           | 7/9/2012-5705-MR-10   | nan
91   | BE   | 7/6/2012 6:23:00    | 7/15/2012 6:00:00  | T           | 7/15/2012-5705-MR-7   | nan
92   | BE   | 2/22/2012 1:56:00   | 2/26/2012 6:00:00  | T           | 2/26/2012-5705-MR-23  | nan
... (114377 rows omitted)